{
  "date": "2024-01-21",
  "originalTranscription": "Witch coming into a medieval town. Everyone flees for cover. Just being in her eye line is dangerous so everyone hides. I get a feeling she's coming from underground ans she's close by. I hear her cackling. I climb a wooden wall and hang on by the top hising on yhe opposite side to the door I think she'd come out of. I hear her close but never see her. I wake up. I fall asleep. I'm blind in my dream. Witch's curse? My sight is regained. I step out into a courtyard with the King, his bodyguard, and a goofy friend of mine. He thrusts a sword at me which I catch between my palms. He pulls back. I turn to the bodyguard, incredulous, to gauge his reaction but he's stoic. I turn back to the King and he thrusts again the same way! I catch the blade once more, exclaiming as I do. This continues, and it dawns on me that I'm stuck in a time loop. A few more desperate explanations in vain and defense manovers and the loop stops. Because my good friend stabs the King in his chest with a pin with a circle attached. His bodyguard lungs at my friend. I come between them urging that he stand trial instead.",
  "summary": "A witch terrorizes a medieval town, causing blindness. After regaining sight, the dreamer enters a time loop where a king repeatedly thrusts a sword at them, which ends when a friend assassinates the king with a pin.",
  "keywords": [
    "witch",
    "medieval",
    "blindness",
    "curse",
    "time loop",
    "king",
    "sword",
    "betrayal",
    "assassination",
    "courtyard"
  ],
  "scenes": [
    {
      "text": "A witch approaches a medieval town from underground, her presence so dangerous that everyone hides. The dreamer climbs a wooden wall to hide on the opposite side of where she might emerge, hearing her cackling nearby but never seeing her before waking.",
      "image": "images/2024-01-21-01.jpg"
    },
    {
      "text": "The dreamer awakens blind, possibly cursed by the witch, then regains sight and steps into a courtyard with a king, his bodyguard, and a friend. The king repeatedly thrusts a sword at the dreamer, who catches it between their palms each time.",
      "image": "images/2024-01-21-02.jpg"
    },
    {
      "text": "The dreamer realizes they're trapped in a time loop as the king's sword thrusts continue. The loop finally breaks when the dreamer's friend stabs the king with a pin attached to a circle. The bodyguard lunges at the friend, but the dreamer intervenes, urging a trial instead.",
      "image": "images/2024-01-21-03.jpg"
    }
  ],
  "fragments": [
    "Waking up, then falling back asleep between dream sequences",
    "The bodyguard's stoic reaction to the king's aggression",
    "A pin with a circle attached as the murder weapon",
    "Catching a sword blade between bare palms repeatedly"
  ]
}
